# Space

## Description
Procedure Space writes a space to the current output file.

```pascal
PROCEDURE Space(n : INTEGER);
```

```python

def vs.Space(n):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|n|INTEGER|Number of spaces.|

## Examples
```pascal
Space(5);

{write 5 spaces to the output file}
```

## Version
Availability: from MiniCAD
## Category
* File I/O